{
  "id_01": {
    "id": "01",
    "title": "Raspberry and custard muffins",
    "difficulty": "Easy",
    "portion": "Makes 12",
    "time": "Hands-on time 25 min. Oven time 18 min",
    "description": "Reminiscent of school traybakes with pink icing, these raspberry and custard muffins are given a suitably chic update - simply by turning cupcakes upside down. Adding custard to the cake batter creates a moist crumb and another layer of nostalgia, that pairs brilliantly with the raspberry in the jam icing.",
    "ingredients": [
      "140g unsalted butter, melted",
      "3 medium free-range eggs",
      "125g custard",
      "1 tsp vanilla bean paste",
      "180g golden caster sugar",
      "180g self-raising flour",
      "4 tbsp seedless raspberry jam",
      "100g icing sugar",
      "Sprinkles to decorate",
      "12-hole muffin tin"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 170°C fan/gas 5. Brush around 20g of the melted butter into each hole of the muffin tin, ensuring some gets into every corner. Pop it in the fridge while you make the cake batter."
      },
      {
        "Step 2": "In a large bowl, use a wooden spoon to mix the remaining 120g melted butter with the eggs, custard, vanilla and sugar until completely combined. Fold in the flour and a pinch of fine sea salt. Divide between the holes in the tin and bake for 14-18 minutes, until golden and springy to touch. Leave to cool in the tin for 5 minutes, then run a palette knife around the edge of each cake to release it. Transfer to a wire rack to cool completely. If the cakes have slight peaks on the base, remove these with a serrated knife once cool."
      },
      {
        "Step 3": "Heat the jam in a small saucepan then sift over the icing sugar and mix until combined. Add a little boiling water until you have a spoonable consistency. Drizzle the icing over each cake, allowing it to drip over the edges a little, then scatter with sprinkles before the icing sets."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/cakes_api/1.jpg"
  },
  "id_02": {
    "id": "02",
    "title": "Lemon and blackberry stripe cake",
    "difficulty": "A challenge",
    "portion": "Serves 10-12",
    "time": "Hands-on time 1 hour 40 min, plus cooling. Oven time 2 hours 15 min",
    "description": "This pretty blackberry cake is an eye-catching centrepiece for any birthday or bake sale. The real drama comes when cutting it open to reveal the vertical stripes of sponge. Don't worry, it's easier to make than you think, and the vast majority of oven time is waiting for the candied lemons to cook through.",
    "ingredients": [
      "1 lemon, cut into 3mm slices",
      "50g golden caster sugar",
      "8 medium free-range eggs, separated",
      "130g golden caster sugar",
      "Finely grated zest 2 lemons, plus 1 tbsp juice",
      "70g plain flour",
      "Icing sugar to dust",
      "100g blackberries, plus extra to decorate",
      "1 tsp lemon juice",
      "2 medium free-range egg whites",
      "135g golden caster sugar",
      "200g unsalted butter, cubed, at room temperature, plus extra to grease",
      "42cm x 30cm shallow baking tray",
      "Stand mixer"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 100°C fan/gas ½. To make the candied lemons, put the sugar and 30ml water in a small frying pan. Bring to the boil and allow to simmer for a minute or two, until syrupy. Add the lemon slices in one layer across the base of the pan. Simmer for 10 minutes, turning halfway, until tender, then lift onto a lined baking tray. Bake for 2 hours, turning halfway, to stiffen a little. Set aside to cool."
      },
      {
        "Step 2": "Increase the oven temperature to 180°C fan/gas 6. Grease and line a shallow 42cm x 30cm baking tray with butter and baking paper. Put the egg yolks, sugar and lemon juice in the bowl of an electric mixer fitted with a whisk attachment and whisk on a medium-high speed for about 3 minutes, until thick and pale. Sift in the flour and add a pinch of salt and the lemon zest. Gently fold together until just combined."
      },
      {
        "Step 3": "In a separate bowl, whisk the egg whites with clean beaters until they form stiff peaks. Mix a spoonful of the egg whites into the cake batter until combined, then gently fold in the rest. Scrape into the prepared baking tray and spread evenly to create a smooth, level top. Bake for 14-15 minutes, until golden and a skewer inserted comes out clean."
      },
      {
        "Step 4": "Put the tray on a wire rack to cool for 5 minutes, then dust the top lightly with icing sugar and cover with a sheet of baking paper topped with a clean tea towel. Carefully flip the tray over and remove both it and the baking paper. Use a serrated knife to trim the edges of the cake, trying to remove as little as possible, just to get them straight (these are a great cook's snack). Starting from one of the shorter sides, carefully roll up the cake into a tight coil, then leave to cool completely (about 30 minutes)."
      },
      {
        "Step 5": "Meanwhile, make the buttercream. Put the blackberries in a blender with the lemon juice, whizz until smooth, then pass through a sieve and set aside. Put the egg whites and sugar in a large heatproof bowl (save on washing up by using the one from your mixer) and set over a pan of simmering water. Whisk the mixture lightly until the sugar has dissolved. To test, dip 2 fingers into the whites and rub together; if you can still feel grains of sugar, it needs a little more time."
      },
      {
        "Step 6": "Remove from the heat, add a pinch of salt and whisk with an electric mixer fitted with a whisk attachment on medium-high for 5-6 minutes until a thick, glossy meringue has formed and can hold peaks. Continue to whisk, adding the butter a piece at a time. Once it's all added you should have a silky buttercream. Fold in 100ml of the whizzed blackberries."
      },
      {
        "Step 7": "Once the cake is cool, unroll it and cut the cake into three long strips, cutting parallel to the long side using a ruler and a serrated knife or pizza cutter. Use about half the buttercream to thinly coat the strips of sponge, spreading it evenly with a palette knife. Take one strip and, starting from the short side, start rolling it back up again, keeping it tight and evenly coiled. Line the seam up with the edge of the second strip and continue to roll it up to make a large cylinder of cake. Repeat with the third strip. This method ensures there are lots of neat, evenly spaced lines of buttercream throughout the sponge. Stand the cylinder up on a serving plate, then use the remaining buttercream to coat the sides and top of the cake and smooth evenly with a palette knife. Decorate with extra blackberries and the candied lemons."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/cakes_api/2.jpg"
  },
  "id_03": {
    "id": "03",
    "title": "Paul Hollywood's chocolate fudge cake",
    "difficulty": "Easy",
    "portion": "Serves 10-12",
    "time": "Hands-on time 20 min, Oven time 25-30 min",
    "description": "In the words of Paul himself: “If you love chocolate cake, you have to try this one.”",
    "ingredients": [
      "175g soft margarine, plus extra to grease",
      "225g light soft brown sugar",
      "200g caster sugar",
      "3 large free-range eggs",
      "1 tsp vanilla extract",
      "250g plain flour",
      "125g cocoa powder",
      "1½ tsp baking powder",
      "½ tsp fine salt",
      "375ml soured cream",
      "For the chocolate frosting",
      "150g dark chocolate, broken into small pieces",
      "100g cocoa powder",
      "100ml just boiled water",
      "225g unsalted butter, softened",
      "6 tbsp icing sugar",
      "3 x 20cm loose-bottomed sandwich tins"
    ],
    "method": [
      {
        "Step 1": "Using a stand mixer fitted with the whisk attachment or electric hand mixer, beat the margarine and sugars together until the mixture is pale and fluffy - this will take around 5 minutes. Scrape down the sides of the bowl with a spatula and whisk again."
      },
      {
        "Step 2": "In a separate bowl, beat the eggs with the vanilla extract. With the mixer still running on a low-medium speed, slowly pour the beaten eggs into the mixture."
      },
      {
        "Step 3": "Sift the flour with the cocoa powder, baking powder and salt. Stir a large spoonful into the whisked mixture, then mix in a large spoonful of the soured cream. Repeat until all the flour and soured cream are incorporated. Beat until you have a smooth batter."
      },
      {
        "Step 4": "Heat the oven to 160°C fan/gas 4. Grease 3 x 20cm loose-bottomed sandwich tins and line the bases with baking paper. Divide the batter equally among the prepared tins. Bake for 25-30 minutes until the cakes are risen and slightly shrunk away from the sides of the tin. Leave to cool in the tins before transferring to a wire rack to cool completely."
      },
      {
        "Step 5": "To make the frosting, melt the chocolate in a heatproof bowl set over a pan of simmering water, making sure the base of the bowl is not in contact with the water. Stir until smooth, then set aside to cool. In another bowl, mix the cocoa powder with the boiling water to make a thick paste."
      },
      {
        "Step 6": "In a large bowl, beat the butter until soft and fluffy, then add the icing sugar and whisk until pale and fluffy. Add the melted chocolate and cocoa paste and beat until the frosting is smooth."
      },
      {
        "Step 7": "To assemble the cake, put one cake layer on your serving plate and spread with a quarter of the frosting. Put a second cake layer on top and spread with another quarter of the frosting. Position the final cake layer on top and cover the top and sides with the remaining frosting. Leave the frosting to set before cutting the cake."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/cakes_api/3.jpg"
  },
  "id_04": {
    "id": "04",
    "title": "Lemon and strawberry meringue cake",
    "difficulty": "Easy",
    "portion": "Serves 12-14",
    "time": "Hands-on time 45 minutes. Oven time 1 hour 20 minutes, plus cooling.",
    "description": "Expect gasps when you unveil this gloriously OTT strawberry cake. The three layers are sandwiched with lemon curd, berries and cream, then topped with a strawberry meringue crown.",
    "ingredients": [
      "250g unsalted butter, at room temperature",
      "250g golden caster sugar",
      "1 tbsp vanilla extract",
      "4 medium free-range eggs",
      "Grated zest and juice 1 lemon",
      "230g plain flour",
      "1 tsp salt",
      "2 tsp baking powder",
      " 3 medium free-range egg yolks, plus 1 whole egg",
      "100g caster sugar",
      "Juice 2 lemons",
      "75g butter, cut into cubes",
      "300ml double/whipping cream",
      "300g strawberries, hulled and sliced (halve 6, unhulled, for the top)",
      "Oil to grease",
      "3 medium free-range egg whites",
      "165g caster sugar",
      "Pink or red food colouring",
      "2 tbsp freeze-dried strawberry pieces",
      "3 x 18cm springform cake tins, lined with baking paper"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 160°C fan/gas 4. Beat the butter and sugar until light and fluffy, add the vanilla, then beat in the eggs one at a time. Stir in the lemon zest and juice, then gently mix in the flour, salt and baking powder. Divide the mix among the tins and level the tops. Bake for 20 minutes until a skewer pushed into the middle comes out clean. Transfer the tins to a rack to cool completely, then remove the cakes from the tins. Reduce the oven to 120°C fan/gas 1."
      },
      {
        "Step 2": "For the lemon curd, whisk the egg yolks, whole egg, sugar and lemon juice in a small pan. Put over a low-medium heat and whisk continuously until starting to thicken. When the mix begins to steam, gradually whisk in the butter, cube by cube, until the mixture is thick and cooked through. When the curd has the thickness of whipped cream, take off the heat and pour through a sieve into a small bowl to cool completely."
      },
      {
        "Step 3": "For the meringue crown, line a baking tray with baking paper and sit an oiled springform ring on the tray, without the base. Whisk the egg whites to soft peaks (see Be A Better Cook for our guide to whipping), add half the sugar and beat for 5 minutes, then add the remaining sugar and beat for a further 5 minutes until the sugar has dissolved and the meringue is glossy."
      },
      {
        "Step 4": "Sprinkle a few drops of food colouring and the freeze-dried strawberry pieces over the meringue, then use a tablespoon to gently fold them through the meringue in 3-4 folds to create a ripple effect. Spoon this mixture onto the lined baking tray using the springform tin to guide the size and shape - the meringue doesn't need to touch the sides of the tin as it will expand in the oven, so leave about a 2cm gap around the edge. Try to create a spiky, swirly top for a crown effect."
      },
      {
        "Step 5": "Bake for 1 hour, then turn off the oven and let the meringue cool for 30 minutes in the oven with the door ajar. Remove and allow to cool completely, then remove the ring, using a sharpknife to detach it first."
      },
      {
        "Step 6": "To assemble, whip the cream until soft peaks (that flop over) form. Put one cake layer on a cake stand, spread with a third of the lemon curd, then half the cream and half the sliced berries. Top with another cake layer, then repeat with another third of the curd and the remaining cream and sliced berries. Finish with the final cake layer and most of the remaining curd, then add the meringue crown. Dot the rest of the curd over the meringue, then decorate with the strawberry halves. Serve in slices."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/cakes_api/4.jpg"
  },
  "id_05": {
    "id": "05",
    "title": "Vegan chocolate cake",
    "difficulty": "Easy",
    "portion": "Serves 12",
    "time": "Hands-on time 40 min, plus cooling and a few hours firming; Oven time 1 hour 5-10 min",
    "description": "Our vegan chocolate cake is dairy-free and egg-free and comes with a vegan buttercream, amaretto and jam filling, and is covered in a gorgeously silky ganache. It's stop-you-in-your-tracks good!",
    "ingredients": [
      "300ml unsweetened soy milk",
      "1 tbsp finely ground/milled chia seeds",
      "1 tbsp lemon juice",
      "1 tsp instant coffee powder",
      "2 tsp vanilla extract",
      "150g vegan spread, such as Vitalite or Flora 100% Natural, melted",
      "3 tbsp agave nectar",
      "175g caster sugar",
      "35g cocoa powder",
      "300g self-raising flour",
      "200g dairy-free dark chocolate (about 45% cocoa solids)",
      "250ml plant-based double cream alternative - we used Elmlea Plant",
      "1 tbsp agave nectar",
      "90g vegan spread",
      "1 tsp vanilla extract",
      "1 tbsp unsweetened soy milk",
      "2 1/2 tbsp cocoa, sifted",
      "180g icing sugar, sifted",
      "4-8 tbsp vegan amaretto",
      "6 tbsp good quality black cherry jam (see Tips)"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 160°C fan/ gas 4. Line the base and sides of the cake tin. In a large jug, whisk together the soy milk, chia, lemon juice, coffee powder, vanilla, melted spread and agave nectar. Set aside for 5 minutes (don't worry if it looks curdled)."
      },
      {
        "Step 2": "Sift the sugar, cocoa and flour into a large bowl. Pour in the wet mix, whisk with a balloon whisk until smooth, then spoon into the prepared tin, smoothing the top. Bake for 45 minutes, then cover loosely with foil and cook for 25-30 minutes until springy to the touch and a skewer pushed into the centre comes out clean. Transfer to a cooling rack for an hour, then remove from the tin and leave to cool completely (see Make Ahead)."
      },
      {
        "Step 3": "For the ganache, put all the ingredients in a bowl set over a pan of barely simmering water. Stir occasionally until melted (or microwave on a medium heat for about 3 minutes). Remove from the heat and leave somewhere cool until it begins to firm up - this may take a few hours. To cool it faster, put the bowl in a larger bowl filled with iced water. Stir every minute or so to ensure it doesn't get too firm - when you lift out the spoon and gently let a little ganache fall back onto the mix, it should briefly form a visible line (ribbon) on top."
      },
      {
        "Step 4": "For the buttercream, use an electric mixer to beat the spread until pale. Whisk in the vanilla and soy milk to combine. Add the cocoa and icing sugar, then beat until pale and fluffy."
      },
      {
        "Step 5": "To assemble, use a sharpknife to cut the cooled cake into 3 layers. Drizzle the cut side of each layer with 1-2 tbsp amaretto. (If you have time, put the drizzled layers in the freezer for an hour to firm up and make assembling/decorating easier.)"
      },
      {
        "Step 6": "Spread the top of the bottom and middle layers with half the buttercream each, then add half the jam to each, spreading thinly until about 1cm from the edge. Stack the cake layers using the undecorated one as the top, then transfer to a serving plate."
      },
      {
        "Step 7": "Use a palette knife to spread the ganache on the sides so they're well covered, then pile and swirl the rest on top. Leave the cake in a cool place for a few hours until firm enough to cut."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/cakes_api/5.jpg"
  },
  "id_06": {
    "id": "06",
    "title": "Spiced plum cake with swiss meringue frosting",
    "difficulty": "Easy",
    "portion": "Serves 8-10",
    "time": "Hands-on time 45 min",
    "description": "Usher in autumn with our spiced plum cake. A golden sponge studded with juicy red plums is coated in a thick layer of swiss meringue frosting.",
    "ingredients": [
      "350-400g red plums, halved and stoned",
      "2 tbsp golden syrup",
      "2 tbsp soft dark brown sugar",
      "6 cardamon pods, crushed with the flat of a cook's knife",
      "1 cinnamon stick",
      "225g butter, softened",
      "225g golden caster sugar",
      "3 medium free-range eggs",
      "1 tsp baking powder",
      "75g ground almonds",
      "1 tsp ground cinnamon",
      "200g self-raising flour",
      "150g egg whites (about 5)",
      "300g white caster sugar"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 170ºC fan/ gas 5. Toss the plums in a small roasting tin with the golden syrup, brown sugar and the whole spices. Bake for 30 minutes until the plums are tender and the juice is syrupy. Set aside to cool. Remove and discard the whole spices."
      },
      {
        "Step 2": "Turn down the oven to 160ºC fan/gas 4. For the cake, use an electric mixer to beat the butter and golden caster sugar until pale and creamy, then add the eggs one at a time, beating between additions (see Know How). Mix the baking powder, ground almonds and ground cinnamon with the flour, then mix into the cake batter in a couple of additions."
      },
      {
        "Step 3": "Gently stir in 2-3 spoonfuls of the cooled plum syrup, then ripple through the cooked plums. Spoon the cake batter into the prepared tin, level the top, then bake for 45-55 minutes, Turn the oven down a notch if the cake starts to brown too much."
      },
      {
        "Step 4": "Leave to cool in the tin on a wire rack for 10 minutes, then unclip the tin and let the cake cool completely."
      },
      {
        "Step 5": "To make the frosting, heat 4cm water in a pan over a low-medium heat to a gentle simmer. Put the egg whites and sugar in a stand mixer bowl (or mixing bowl if using a hand mixer). Rest the bowl over the simmering water and, using a flexible spatula or wooden spoon, stir constantly for 10 minutes or until the sugar has dissolved and the mixture reads 72°C on a digital thermometer. Keep the water at the gentlest simmer or you risk cooking the egg whites and you'll have to start again."
      },
      {
        "Step 6": "Once the mixture reaches 72°C, remove from the heat and whisk on medium speed until stiff peaks form (that don't flop over) and the meringue is no longer warm to the touch."
      },
      {
        "Step 7": "Spoon the cooled meringue frosting over the top and sides of the cake, swirling it into attractive patterns, then (if you like) use a blowtorch to caramelise the swirls."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/cakes_api/6.jpg"
  },
  "id_07": {
    "id": "07",
    "title": "Lemon and courgette cake with white chocolate cream cheese frosting",
    "difficulty": "Easy",
    "portion": "Serves 12-14",
    "time": "Hands-on time 1 hour, plus chilling and cooling",
    "description": "This gorgeous lemon and courgette cake features layers of zesty sponge layered with homemade lemon curd and white choc cream cheese frosting.",
    "ingredients": [
      "375g unsalted butter, softened300g caster sugar5 medium free-range eggs, at room temperature375g self-raising four1 tsp bicarbonate of soda2 tsp ground ginger300g courgettes, grated (see Know How)Grated zest 4 lemonsCandied lemon slices to decorate (see Know How and use the zested lemons above)",
      "375g unsalted butter, softened",
      "300g caster sugar",
      "5 medium free-range eggs, at room temperature",
      "375g self-raising four",
      "1 tsp bicarbonate of soda",
      "2 tsp ground ginger",
      "300g courgettes, grated (see Know How)",
      "Grated zest 4 lemons",
      "Candied lemon slices to decorate (see Know How and use the zested lemons above)",
      "115g caster sugar3 medium free-range eggs, plus 2 medium free-range egg yolks1 tbsp cornflourGrated zest and juice 2 large lemons (about 150ml juice)75g cold unsalted butter, diced",
      "115g caster sugar",
      "3 medium free-range eggs, plus 2 medium free-range egg yolks",
      "1 tbsp cornflour",
      "Grated zest and juice 2 large lemons (about 150ml juice)",
      "75g cold unsalted butter, diced",
      "375g unsalted butter, softened and at room temperature200g icing sugar300g full-fat cream cheese (we used Philadelphia) at room temperature150g white chocolate, melted and cooledSqueeze of lemon juice",
      "375g unsalted butter, softened and at room temperature",
      "200g icing sugar",
      "300g full-fat cream cheese (we used Philadelphia) at room temperature",
      "150g white chocolate, melted and cooled",
      "Squeeze of lemon juice",
      "Electric hand or stand mixer",
      "2 x 20cm loose-bottomed round cake tins, lined with compostable baking paper"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 160ºC fan/gas 4. To make the cake, beat the butter and sugar in a stand mixer on medium speed (use the paddle attachment), scraping down the sides twice, until the mixture is pale and fluffy - 6-8 minutes (or use a hand mixer). Beat in the eggs, one at a time, allowing each addition to be incorporated before adding the next. After the last egg is added, scrape down the sides once more, then beat for 2 minutes."
      },
      {
        "Step 2": "Sift together the flour, bicarb and ginger, then gently fold into the wet mixture using a figure-of-eight motion until just combined. Finally, gently fold in the courgettes and lemon zest. Divide the batter evenly between the prepared tins, smooth the tops, then bake for 25-30 minutes until golden and a skewerpushed into the middle comes out clean. Cool in the tins for 10 minutes, then turn out onto a wire rack and set aside to cool completely (see Make Ahead)."
      },
      {
        "Step 3": "To make the lemon curd, beat the sugar, eggs, yolks and cornflour in a medium heatproof bowl using a balloon whisk. Add the lemon zest and juice and beat until combined. Sit the bowl over a pan of barely simmering water and cook, stirring frequently, for 15-20 minutes until very thick, taking care not to let the mixture get too hot or it will curdle. Remove from the heat and whisk in the cold butter, 2 cubes at a time. Press a piece of cling film directly onto the surface of the curd and set aside to cool completely (see Make Ahead)."
      },
      {
        "Step 4": "For the buttercream, beat the butter and icing sugar in a stand mixer or with a hand mixer until fluffy. Gradually beat in the cream cheese, bringing the mix back to a smooth consistency before adding more. Add the melted chocolate and a squeeze of lemon, scrape down the sides of the bowl and beat again until well combined. Cover and chill for 1-2 hours until firmed up."
      },
      {
        "Step 5": "To assemble, slice the cooled cakes horizontally in half (see Know How). Secure 1 layer of cake, cut-side up, to a serving plate or cake stand using a blob of the buttercream. Spread 2 large spoonfuls of buttercream over the cake, followed by about a third of the lemon curd. Repeat the cake, buttercream and curd layers twice more, finishing with the final cake layer."
      },
      {
        "Step 6": "Chill the cake for 30 minutes to firm up the buttercream, then coat the top and sides with a thin layer of buttercream (known as a crumb coat - it should be so thin you can see through it). Return the cake to the fridge for 1 hour, then spread with the remaining buttercream, giving it a smooth or swirled design as you prefer. Decorate with the candied lemon slices (see Know How)."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/cakes_api/7.jpg"
  },
  "id_08": {
    "id": "08",
    "title": "Chocolate cake with caramel poached pears and chocolate buttercream",
    "difficulty": "Medium",
    "portion": "Serves 12-15",
    "time": "Hands-on time 30 min, plus cooling",
    "description": "Give chocolate cake an autumnal twist. Fill this rich chocolate sponge with silky swiss meringue buttercream and top with caramel poached pears:.",
    "ingredients": [
      "300g caster sugar",
      "80g light muscovado sugar",
      "180g dark chocolate (60-70% cocoa solids)• 130g butter, diced",
      "1 tbsp espresso powder",
      "170ml buttermilk",
      "1 medium free-range egg, plus 2 medium egg yolks (reservethe whites for the buttercream)",
      " 300g plain flour",
      "40g dutch-processed cocoa powder (such as Green& Black's; see Know How)",
      "1¼ tsp bicarbonate of soda",
      "300g caster sugar",
      "1 cinnamon stick",
      "2 star anise",
      "1 vanilla pod, split lengthways, seeds scraped",
      "5 small firm pears, peeled (such as bosc, comice or williams)",
      "150g caster sugar",
      "140g egg whites (about 5)",
      "¼ tsp salt",
      "300g unsalted butter, diced  and softened",
      "100g dark chocolate, melted and cooled",
      "100g milk chocolate, melted and cooled",
      "1 tsp vanilla extract",
      " 2 x 20cm loose-bottomed round cake tins, lined with compostable baking paper",
      "Digital probe thermometer",
      "Electric hand or stand mixer"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 160ºC fan/gas 4. To make the cake, put both sugars, the chocolate, butter, espresso powder and 250ml water in a pan, then stir over a low heat until melted and smooth. Whisk in the buttermilk, followed by the egg and yolks, until smooth and well combined."
      },
      {
        "Step 2": "Sift the flour, cocoa and bicarb into a large bowl. Make a well in the middle, then pour in the chocolate mixture and whisk until just combined."
      },
      {
        "Step 3": "Divide the batter between the prepared tins and bake for 45-50 minutes until a skewer pushed into the centre comes out clean. Cool the cakes in the tins for 10 minutes, then turn out onto a wire rack and set aside to cool completely (see Make Ahead)."
      },
      {
        "Step 4": "To make the poached pears, put the sugar in a pan that will just fit the pears, along with 3 tbsp water. Stir over a low heat until the sugar dissolves, then bring to the boil and simmer, swirling the pan from time to time, to create a dark caramel. Take the pan off the heat and add a splash of water (be careful as it will spit). Add 1 litre water, the spices and vanilla seeds and pod, then bring to the boil. Reduce the heat to low, add the pears and simmer for 25-30 minutes until tender. Reserve 250ml poaching liquid, then leave the pears to cool in the remainder (see Make Ahead)."
      },
      {
        "Step 5": "Put the reserved liquid in a pan and bubble until slightly thickened, syrupy and reduced by about ½. Set aside to cool."
      },
      {
        "Step 6": "To make the swiss buttercream, put the sugar, egg whites and salt in a large clean bowl set over a pot of barely simmering water. Cook, stirring, until the sugar dissolves and the mixture reads 72°C on a thermometer. Transfer to a bowl/stand mixer bowl and whisk with an electric mixer on medium until thick, glossy and completely cool."
      },
      {
        "Step 7": "Whisk in the butter, 2 cubes at a time, incorporating each addition into the meringue before adding the next. Continue until all the butter is added. The mixture will look curdled at first, but keep whisking and it will come back together. Increase the mixer speed to high and whisk for 2 minutes more. Add both cooled chocolates, then whisk again until combined. Set aside at room temperature until ready to assemble (see Make Ahead)."
      },
      {
        "Step 8": "To assemble, put one cake bottom-side up on a serving plate or cake stand. Drizzle with 2 tbsp of the reduced pear syrup, then spread with a third of the buttercream. Halve, core and thinly slice 2 of the pears, then arrange on top of the buttercream. Sandwich with the second cake. Drizzle more syrup over the top, then pile on the remaining buttercream, creating pillowy waves (or smooth the top and sides to fully frost if you prefer). Dip the poached pears in the reduced syrup so they're glossy and arrange on top of the cake. Drizzle with more syrup when ready to serve."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/cakes_api/8.jpg"
  },
  "id_09": {
    "id": "09",
    "title": "Rhubarb and custard layer cake",
    "difficulty": "Easy",
    "portion": "Cuts into 16 slices",
    "time": "Hands-on time 60-70 min, oven time 70-85 min, plus cooling and setting",
    "description": "This glorious rhubarb and custard layer cake is so pretty: its jaw-dropping decoration makes it perfect for special occasions such as Easter Sunday or Mother's Day. If you want to make the cake less fancy, it tastes just as good unadorned.",
    "ingredients": [
      "250g unsalted butter, softened, plus extra to grease",
      "250g caster sugar",
      "1 tsp vanilla extract",
      "4 large free-range eggs",
      "250g self-raising flour",
      "3-4 tbsp whole milk",
      "9-12 tbsp (about 200g) shop-bought rhubarb jam - or see tips",
      "300ml whole milk",
      "½ tsp vanilla bean paste",
      "3 large free-range egg yolks (see Tip)",
      "60g caster sugar",
      "45g cornflour",
      "200ml double cream",
      "400g forced rhubarb, cut into 5cm pieces",
      "1 unwaxed orange",
      "125g caster sugar",
      "125g unsalted butter, softened",
      "80g icing sugar",
      "100g full-fat cream cheese (we used Philadelphia) at room temperature",
      "Squeeze of lemon/orange juice",
      "100g Lindt white chocolate, chopped",
      "200g Lindt Lindor white chocolate truffles, chopped",
      "Candied rhubarb (see Tip)",
      "Electric mixer",
      "2 x 20cm cake tins, greased and lined with compostable baking paper",
      "Extra compostable baking paper",
      "Deep baking dish",
      "Foil",
      "Piping bag fitted with 0.5cm nozzle"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 180°C/160°C fan/gas 4. Beat the butter, sugar and vanilla extract in a large mixing bowl until pale and fluffy. Add the eggs, one at a time, beating well between each addition. Fold in the flour with a pinch of salt, adding 3-4 tbsp milk, as needed, to form a smooth batter."
      },
      {
        "Step 2": "Divide the batter between the cake tins and bake in the centre of the oven for 20-25 minutes until golden and risen and a skewer pushed into the centre comes out clean. Turn out onto a wire rack and leave to cool."
      },
      {
        "Step 3": "For the filling, put a small pan over a low heat and heat the milk and vanilla bean paste until simmering. Whisk the egg yolks, sugar and cornflour in a bowl. Slowly whisk in the hot milk, then return the mixture to the pan. Cook over a medium heat, whisking, for 2-3 minutes until thick. Cover with slightly damp compostable baking paper to prevent a skin forming, then leave to cool. Whisk the cream to firm peaks. Beat the custard to soften, whisk in a dollop of cream to loosen further, then fold in the rest of the cream."
      },
      {
        "Step 4": "For the roasted rhubarb, heat the oven to 110°C/90°C fan/gas ¼. Arrange the rhubarb in a single layer in a deep baking dish. Pare 3 strips of orange zest, then slice the strips thinly and add to the rhubarb with the juice of the orange. Sprinkle over the sugar and mix gently. Cover with foil and bake for 50-60 minutes. Remove from the oven, uncover and carefully pour any juices into a pan. Boil the juices rapidly for 5-6 minutes until slightly reduced. Cool, then pour back over the rhubarb."
      },
      {
        "Step 5": "For the buttercream, whisk the butter and icing sugar in a mixing bowl until fluffy. Gradually beat in the cream cheese, bringing back to a smooth consistency before adding more. Add a squeeze of lemon/orange juice to taste."
      },
      {
        "Step 6": "To assemble the cake, put 1 tbsp buttercream in the centre of a serving plate. Halve each cake horizontally and set one half on the buttercream to secure it. Spread 3-4 tbsp jam over the centre of the top, then pipe or spread a quarter of the custard over this. Repeat the cake, jam and custard layers twice more, then top with the final cake half. Cover the cake in a thin layer of buttercream. Set aside or chill until ready to serve or decorate (optional)."
      },
      {
        "Step 7": "For the decoration, put the chopped chocolate in a small heatproof bowl set over a pan of barely simmering water, making sure the bowl doesn't touch the water. Leave to melt (don't stir), then spread over the lined baking tray and leave to set. Once hard, break into large shards. Put the chopped truffle balls in the same bowl and set back over the pan of barely simmering water to melt. Set aside for 10-15 minutes to cool slightly and thicken."
      },
      {
        "Step 8": "Drizzle some melted truffles over the top of the cake, encouraging a few drips down the sides. Spoon the remaining custard on top, then nestle in some of the roasted rhubarb. Add a drizzle of melted truffles, followed by candied rhubarb (see box, opposite) and chocolate shards. Slice and serve with extra roasted rhubarb and syrup on the side, if you like (or see tips)."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/cakes_api/9.jpg"
  },
  "id_10": {
    "id": "10",
    "title": "Spring lamb cupcakes",
    "difficulty": "Easy",
    "portion": "Makes 12",
    "time": "Hands-on time 40 min, oven time 15-18 min, plus cooling",
    "description": "These cute Easter cupcakes shaped as spring lambs are perfect for baking with kids over the long Easter bank holiday weekend.",
    "ingredients": [
      "150g butter, softened",
      "150g caster sugar",
      "150g self-raising flour",
      "3 large free-range eggs",
      "2 tbsp milk",
      "½ tsp vanilla extract",
      "150g black sugarpaste",
      "15g white sugarpaste (see tips)",
      "100-120g white mini marshmallows",
      "50g butter, softened",
      "100g icing sugar, plus extra for dusting",
      "Few drops vanilla extract",
      "12-hole muffin tin lined with cupcake cases",
      "Electric mixer"
    ],
    "method": [
      {
        "Step 1": "To make the cupcakes, heat the oven to 190°C/170°C fan/gas 5. Put the butter, sugar, flour, eggs, milk and vanilla extract in a large mixing bowl and beat using an electric mixer until light and fluffy. Divide the mixture among the cupcake cases in the tin and bake for 15-18 minutes or until the cakes have risen and spring back when lightly pressed in the centre. Remove from the oven and transfer to a wire rack to cool."
      },
      {
        "Step 2": "To make the sheep faces, break off a small piece of black sugarpaste (about 10g in weight), then knead to soften and shape into an oval. Slightly flatten the oval, shape to make one end slightly narrower than the other (to create the forehead and chin), then set aside."
      },
      {
        "Step 3": "Take 2 smaller pieces of black sugarpaste, knead gently, then flatten into little ovals for the ears. Press these onto either side of the wider part of the head (see tips)."
      },
      {
        "Step 4": "To make the eyes, take 2 small balls of white sugarpaste and press them onto the head, flattening them slightly. Then make 2 very tiny balls of black sugarpaste and press onto the eyes (or see tips). If you like, make a small long cone shape from the black sugarpaste and flatten it slightly for a tail."
      },
      {
        "Step 5": "To make the buttercream frosting, put the butter in a large mixing bowl and add the icing sugar, vanilla extract and 1 tbsp boiling water. Beat well until smooth, light and fluffy."
      },
      {
        "Step 6": "Working on one cake at a time, spread buttercream over the top of a cake and stick on a head, then press white mini marshmallows around it, all over the top. Stick on the tail, if using. Let the children pile in…"
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/cakes_api/10.jpg"
  },
  "id_11": {
    "id": "11",
    "title": "Peanut butter drip cake",
    "difficulty": "Medium",
    "portion": "Serves 20",
    "time": "Hands-on time 1½ hours, oven time 20-25 min, plus chilling ",
    "description": "A dark chocolate sponge is sandwiched and covered with peanut buttercream, drizzled with a rich chocolate ganache then topped with chocolate biscuits and sweets.",
    "ingredients": [
      "80g dark cocoa powder (we used Green & Blacks)",
      "350g light muscovado sugar",
      "1 tbsp espresso powder",
      "300ml boiling water",
      "300g unsalted butter, softened, plus extra for greasing",
      "150g dark chocolate, roughly chopped",
      "6 medium free-range eggs, fridge-cold, beaten",
      "1 tbsp vanilla bean extract",
      "220g plain flour",
      "1 tsp bicarbonate of soda",
      "1 tsp baking powder",
      "225g unsalted butter, softened",
      "250g smooth peanut butter",
      "375g icing sugar",
      "1 tsp vanilla extract",
      "½ tsp fine sea salt",
      "2 tbsp milk",
      "150g dark chocolate (at least 70% cocoa solids), finely chopped",
      "300ml double cream",
      "3 x 20cm sandwich tins, greased and base-lined with non-stick baking paper",
      "An electric mixer"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 170°C/150°C fan/gas 3½. Put the cocoa powder, 100g of the muscovado sugar and the espresso powder into a large measuring jug. Pour in the boiling water and whisk with a balloon whisk until smooth."
      },
      {
        "Step 2": "In a medium pan set over a low heat, melt the butter and the remaining sugar until dissolved. Add the dark chocolate and slowly melt together, stirring occasionally."
      },
      {
        "Step 3": "Once melted, take off the heat, pour in the cocoa and coffee mixture, beaten eggs and vanilla bean extract, then whisk with a balloon whisk until combined. Sift the flour, bicarb and baking powder into a large mixing bowl, then pour over the chocolate mixture with a pinch of salt. Gently mix with a balloon whisk to form a smooth batter."
      },
      {
        "Step 4": "Divide the batter equally between the prepared tins and level using a spatula. Bake for 20-25 minutes until the sponges have risen and a skewer inserted into the centre comes out clean. Cool for 5 minutes in the tin, then turn out onto a wire rack to cool completely."
      },
      {
        "Step 5": "Meanwhile, make the peanut buttercream. Put the butter and peanut butter in a mixing bowl and whip using an electric mixer until light and fluffy. Add the icing sugar, one-third at a time, whisking between each addition, until smooth and stiff. Whisk in the vanilla, salt and enough milk to make a mixture that spreads easily."
      },
      {
        "Step 6": "Once the sponges have cooled, use a serrated knife to level the tops, if needed. Put 1 tsp buttercream in the centre of a cake plate or stand, then put the first sponge in the centre. Smooth a 5mm layer of buttercream on top of the first sponge, then repeat with the next 2 sponges until all 3 cakes are stacked on top of each other. Smooth a thin layer of buttercream all over the cake - don't worry if you pick up some of the crumbs - this layer is called the 'crumb coat'. Once the cake is evenly covered, transfer to the fridge to chill for 30 minutes."
      },
      {
        "Step 7": "Cover the cake with the rest of the icing in a smooth layer, then return to the fridge while you make the ganache."
      },
      {
        "Step 8": "For the ganache, put the chocolate in a large heatproof bowl and put the cream in a pan set over a medium heat. Slowly bring the cream to the boil. As soon as it starts to bubble, pour over the chocolate and leave to stand for 2 minutes. Stir until the chocolate has completely melted, then transfer the ganache to a piping bag."
      },
      {
        "Step 9": "Snip a small hole at the bottom of the piping bag and pipe the ganache steadily and generously around the edge of the cake so that some of it runs down the side creating the 'drips'. Once you're happy with the drips, cover the top of the cake with the remaining ganache. Smooth with a palette knife, then return to the fridge to set for 30 minutes."
      },
      {
        "Step 10": "Decorate with a selection of your favourite chocolates or sweets - we went for Oreos, M & M's and Kit Kats. Be creative!"
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/cakes_api/11.jpg"
  },
  "id_12": {
    "id": "12",
    "title": "Ginger drizzle traybake with cream cheese icing",
    "difficulty": "Easy",
    "portion": "Makes 16",
    "time": "Hands-on time 15 min, oven time 40-45 min",
    "description": "Rich, moist and sticky, this easy ginger traybake cake is topped with cream cheese icing and slices easily into shareable squares. It's perfect for afternoon tea party or bake sale.",
    "ingredients": [
      "250g unsalted butter, cubed",
      "125g golden syrup",
      "250g light muscovado sugar",
      "1 tbsp vanilla bean paste",
      "4 large free-range eggs, beaten",
      "300g self-raising flour",
      "1 tbsp ground ginger, plus extra",
      "2 balls stem ginger in syrup, finely chopped, plus 2 tbsp syrup",
      "3 tbsp natural yogurt",
      "Finely grated zest and juice 1 lime",
      "1/2 tsp salt",
      "170g unsalted butter, softened",
      "170g golden icing sugar",
      "340g full-fat cream cheese (we used Philadelphia)",
      "Grated zest and juice 1 lime",
      "Small handful crystallised ginger (optional), chopped if large",
      "20cm x 30cm shallow cake tin or brownie tin, greased and lined with non-stick baking paper"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 170°C/150°C fan/ gas 31/2. Heat the butter, syrup and sugar in a pan until melted and smooth. Remove from the heat, then leave to cool."
      },
      {
        "Step 2": "Once cooled, beat in the vanilla bean paste, eggs, flour, 1 tbsp ground ginger, chopped stem ginger, yogurt, lime zest and juice and salt until smooth and combined."
      },
      {
        "Step 3": "Pour into the prepared tin and level the top. Bake for 40-45 minutes until a skewer pushed into the centre of the cake comes out clean."
      },
      {
        "Step 4": "Remove the cake from the oven, drizzle the stem ginger syrup over the top, then leave to cool in the tin for 10 minutes. Remove the cake from the tin and put on a cooling rack, leaving the baking paper in place, until cooled completely."
      },
      {
        "Step 5": "For the icing, whisk the butter and icing sugar in a bowl until light and fluffy, then whisk in the cream cheese until smooth. Add lime juice to taste. Spoon the icing over the cake, then sprinkle with crystallised ginger, lime zest and extra ground ginger. Cut into squares to serve."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/cakes_api/12.jpg"
  },
  "id_13": {
    "id": "13",
    "title": "Baked lemon cheesecake with pineapple flowers",
    "difficulty": "Medium",
    "portion": "Serves 10-12",
    "time": "HANDS-ON TIME 30 MIN, OVEN TIME 1 HOUR 35-45 MIN, PLUS CHILLING AND COOLING",
    "description": "You could just make the baked lemon cheesecake (it would still go down a treat) but, if you have the time, we urge you to make the pretty pineapple flowers. They make a fabulous final flourish and are edible too!",
    "ingredients": [
      "200g Hobnob biscuits",
      "75g unsalted butter, melted and cooled, plus extra to grease",
      "340g full-fat cream cheese (we used Philadelphia)",
      "250g mascarpone",
      "200g golden caster sugar",
      "200ml kefir (fermented milk, widely available) or soured cream",
      "3 large free-range eggs",
      "1 tsp vanilla extract",
      "Finely grated zest 3 lemons and juice 2",
      "50g plain flour",
      "200ml soured cream",
      "1 tbsp golden caster sugar",
      "½ small pineapple, peeled, eyes removed and thinly sliced into 12 rounds (slice as thinly as you can and don't remove the core)",
      "A few drops red food colouring",
      "20cm round, deep, loose-bottomed cake tin, base and sides lined with compostable baking paper; mini muffin tray (to set the edible flower decorations)"
    ],
    "method": [
      {
        "Step 1": "For the base, pulse the biscuits in a food processor to make fine crumbs (or put in a freezer bag and bash to fine crumbs using a rolling pin), then mix in the melted butter and a pinch of salt. Pack into the base of the prepared cake tin in an even layer, smoothing down with the back of a spoon. Chill until needed."
      },
      {
        "Step 2": "Heat the oven to 180°C/160°C fan/gas 4. For the filling, put the cream cheese, mascarpone, 200g caster sugar and the kefir/soured cream in a mixing bowl, then mix using a balloon whisk (or an electric mixer) until smooth. Gently whisk in the eggs, one at a time, then add the vanilla extract, lemon zest and all but 2 tsp of the lemon juice. Gently mix in the flour until smooth. Spoon the mixture over the chilled biscuit base, then level the top."
      },
      {
        "Step 3": "Bake for 50-60 minutes until the top is lightly golden and set at the edges but the centre still wobbles when the cheesecake is shaken gently. Remove the tin from the oven and leave to cool on a wire rack."
      },
      {
        "Step 4": "When the cheesecake has cooled, heat the oven to 150°C/130°C fan/gas 2. For the topping, mix the soured cream with the 1 tbsp sugar and the 2 tsp reserved lemon juice, then spread the mixture over the top of the cheesecake and return it to the oven for 25 minutes (it will still be a bit soft and wobbly but will set on cooling). Remove and leave to cool once more, then cover loosely and chill for at least 4 hours (overnight is best - see Make Ahead). Leave the oven on if you're making the pineapple flowers."
      },
      {
        "Step 5": "For the flowers, blot the pineapple slices with kitchen paper, then arrange on 2 baking trays lined with compostable baking paper. Mix a few drops of the food colouring into a tablespoon of water, then drop a little of the colouring onto the middle of half the flowers using a teaspoon. Bake for 20 minutes, then flip and bake for 20 minutes more or until the pineapple feels dry to the touch. While the pineapple flowers are still warm, push each slice into a mini muffin hole to set it in a flower shape (see Make Ahead). Use to decorate the cheesecake, just before serving."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/cakes_api/13.jpg"
  },
  "id_14": {
    "id": "14",
    "title": "Carrot and cheesecake layer cake",
    "difficulty": "A challenge",
    "portion": "Serves 20 (at least)",
    "time": "Hands-on time 1 hour 20 min, oven time 60-70 min, plus cooling and up to 7 hours chilling ",
    "description": "Four layers of carrot cake sponge are sandwiched between a chocolate and vanilla marbled cheesecake filling and thick layers of cream cheese icing. It's a truly spectacular celebration cake that's perfect for feeding a crowd.",
    "ingredients": [
      "350g plain flour",
      "¼ tsp ground nutmeg",
      "¼ tsp ground cinnamon",
      "3 cardamom pods, seeds removed and crushed in a pestle and mortar",
      "¼ tsp ground allspice",
      "1 tsp bicarbonate of soda",
      "1 tsp baking powder",
      "3 large free-range eggs",
      "260g caster sugar",
      "½ tsp salt",
      "180ml vegetable oil",
      "350g carrots, grated",
      "180g greek yogurt",
      "70g dark chocolate, chopped",
      "400g full-fat cream cheese (we used Philadelphia)",
      "115g caster sugar",
      "25g cornflour",
      "1 large free-range egg, beaten",
      "125g whipping cream",
      "¼ tsp vanilla extract",
      "180g butter, softened",
      "250g icing sugar",
      "2 tbsp golden syrup",
      "800g full-fat cream cheese (we used Philadelphia)",
      "2 tsp vanilla extract",
      "Edible flowers to decorate (optional; from Fine Food Specialist)",
      "2 x 20cm spring-form deep cake tins, greased, bases lined with non-stick baking paper"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 170°C/150°C fan/gas 3½. In a large mixing bowl mix the flour with the spices, bicarbonate of soda and baking powder. Whisk together the eggs, sugar, salt and vegetable oil in a jug, then pour over the dry ingredients, followed by the grated carrots and yogurt. Mix with a wooden spoon until just combined, then divide between the prepared cake tins and bake for 25-35 minutes until a skewer pushed into the centre of the cake comes out clean. Leave to cool for 5 minutes in the tins, then turn out on a rack to cool completely. "
      },
      {
        "Step 2": "Once the cakes are out of the oven, reduce the oven temperature to 140°C/120°C fan/gas 1. Next, make the cheesecake layer. Grease and re-line one of the cake tins, then melt the chocolate in a heatproof bowl set over a pan of barely simmering water (don't let the bowl touch the water) and set aside."
      },
      {
        "Step 3": "Using a hand whisk, beat together the cream cheese and caster sugar in a mixing bowl until the sugar crystals have dissolved and the mixture is smooth. Add the cornflour and mix again until combined, then add the egg and whipping cream, mixing gently until smooth."
      },
      {
        "Step 4": "Remove one third of the mixture to a clean mixing bowl and stir in the melted dark chocolate until fully combined. Mix the vanilla extract into the remaining mixture, then pour into the prepared cake tin. Spoon the chocolate mixture over the top and use a skewer to create a marbled pattern in the cheesecake mixture. Bake in the centre of the oven for 35 minutes until set but still with a slight wobble. Leave to cool completely in the tin, then transfer to the freezer to cool for an hour. If you don't have room in the freezer, put in the fridge for 4-6 hours (or overnight - see Make Ahead). Chilling the cheesecake well will make the cake easier to assemble."
      },
      {
        "Step 5": "To make the cream cheese frosting, using an electric hand mixer, beat the butter, icing sugar and golden syrup in a mixing bowl until light and fluffy, then gently beat in the cream cheese and vanilla extract."
      },
      {
        "Step 6": "To assemble the cake, trim the domed top off each sponge to flatten them (it's easiest to use a bread knife), then slice each cake in half horizontally to make 4 even layers. Put the bottom half of one sponge on a cake board or serving plate, then spread with a layer of cream cheese frosting about 0.5-1cm thick. Add the top half of the carrot cake, then a thinner coating of icing. Put the cheesecake layer on top and spread with another thin layer of icing. Top with the last 2 layers of carrot cake, with a thicker layer of icing between the two. Transfer to the fridge and leave to set for an hour, then cover the cake all over with the remaining icing. Decorate with edible flowers, if you like."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/cakes_api/14.jpg"
  },
  "id_15": {
    "id": "15",
    "title": "Sugarplum fairy cakes",
    "difficulty": "Medium",
    "portion": "Makes 12",
    "time": "Hands-on time 40-45 min, oven time 20-25 min, plus cooling",
    "description": "Soft and fluffy fairy cakes are dotted with little nuggets of marzipan and come topped with buttercream and caramel shards. A cake fit for a fairy queen.",
    "ingredients": [
      "120g unsalted butter, softened",
      "110g caster sugar",
      "2 large free-range eggs",
      "120g self-raising flour",
      "100g marzipan, chopped into 0.5cm square chunks",
      "150g caster sugar",
      "20 cardamom pods, seeds removed and crushed (pods discarded)",
      "200g lightly salted butter, softened",
      "300g icing sugar",
      "1-2 tbsp milk (as needed)",
      "Finely grated zest 1 lemon",
      "12-hole cupcake tin",
      "12 cupcake cases",
      "Piping bag & star nozzle (optional)"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 180°C/160°C fan/gas 4 and line the cupcake tin with the cases. To make the sponge mixture, beat the butter and caster sugar together in a mixing bowl using an electric mixer until light and fluffy, then beat in the eggs one at a time. Reduce the mixing speed and beat in the flour with a pinch of salt until just combined. Stir the marzipan chunks into the batter using a metal spoon, then divide the mixture among the cases and bake for 20-25 minutes until risen, golden and springy. Remove from the tin and leave to cool on a wire rack."
      },
      {
        "Step 2": "To make the caramel shards, line your largest baking tray with non-stick baking paper and put in a warm oven. Put the sugar in a spotlessly clean and dry frying pan, put over a low-medium heat and leave to melt (resist touching it)."
      },
      {
        "Step 3": "Once the sugar begins to melt, turn the heat up a little and keep an eye on it - if it starts to caramelise in places before all the sugar has melted, tilt the pan to move the sugar around. Once it's completely liquid, remove the baking tray from the oven, turn up the heat under the pan and keep tilting the pan until all the sugar is deep golden. Immediately tip the caramel onto the baking tray and, working quickly, tip the tray to spread the hot mixture as thinly as possible. Scatter over the crushed cardamom and leave somewhere cool to harden."
      },
      {
        "Step 4": "For the buttercream, put the butter in a mixing bowl and beat for a few minutes with an electric hand mixer until fluffy. Sift in the icing sugar in 3-4 additions, beating well after each one, until it forms a smooth icing. If it's too stiff to pipe, beat in the milk, then quickly beat in the lemon zest. Transfer to a piping bag fitted with a star nozzle, if using."
      },
      {
        "Step 5": "To decorate the fairy cakes, pipe swirls of icing, or spoon on and smooth with a palette knife. Use the point of a sharp knife to crack the caramel into shards, then use the prettiest for the cakes - stick them into the icing so they stand upright. Serve immediately."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/cakes_api/15.jpg"
  },
  "id_16": {
    "id": "16",
    "title": "Summer-cup bundt drizzle cake",
    "difficulty": "Easy",
    "portion": "Serves 12",
    "time": "Hands-on time 35 min, oven time 3 hours, plus cooling",
    "description": "Celebrate summer in style with Felicity Cloake's boozy bundt drizzle cake. She says:",
    "ingredients": [
      "280g ground almonds",
      "90g plain flour",
      "280g butter, softened",
      "325g caster sugar, plus 1 tbsp",
      "6 medium free-range eggs, beaten",
      "Grated zest and juice 2 lemons",
      "80ml gin, preferably cucumber flavoured",
      "80ml red vermouth",
      "30ml triple sec",
      "2 dashes bitters",
      "2 tbsp agave syrup",
      "1 whole orange, plus juice ½",
      "130g icing sugar",
      "400g punnet strawberries",
      "1 apple",
      "¼ cucumber",
      "1 small bunch fresh mint",
      "23cm bundt tin, well greased with butter and chilled"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 180°C/160°C fan/gas 4. Mix the ground almonds and flour in a medium mixing bowl with a pinch of salt, then set aside. Beat the butter in a stand mixer, or in a mixing bowl using an electric hand mixer, until it has the consistency of mayonnaise from a jar. Add the 325g sugar and beat on a medium speed for about 5 minutes until very light and fluffy, periodically scraping down the sides of the bowl."
      },
      {
        "Step 2": "Beat the eggs into the butter and sugar mixture, one third at a time, letting the batter just come together before the next addition. Don't worry if it splits with the last addition."
      },
      {
        "Step 3": "Turn down the speed and add the almonds/flour, one third at a time, until combined - but don't over-mix."
      },
      {
        "Step 4": "Put the lemon zest into a jug and add 50ml gin, 50ml vermouth, 20ml triple sec and a dash of bitters. Put a large spoonful of the cake batter in a small bowl, beat in the lemon zest cocktail, then fold into the rest of the batter with a large metal spoon."
      },
      {
        "Step 5": "Sprinkle the 1 tbsp caster sugar into the greased bundt tin, turning to coat the inside completely. Gently spoon in the batter, then bake for 1 hour until golden and a skewer pushed into the deepest part of the cake comes out clean. Leave in the tin for 15 minutes, then turn out onto a plate."
      },
      {
        "Step 6": "Whisk the agave syrup with the remaining alcohol and bitters, and the juice of the 2 lemons, then pour two thirds of the mixture over the warm cake. When the cake has cooled, mix the orange juice with the icing sugar and drizzle over."
      },
      {
        "Step 7": "Roughly chop the strawberries, peel and cut the orange into discs, slice the apple and peel the cucumber into ribbons (see Make Ahead). Put into a plastic tub with the remaining alcoholic syrup and a handful of chopped mint (reserve a few sprigs to garnish). At the picnic, top the cake with the fruit and the reserved mint."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/cakes_api/16.jpg"
  },
  "id_17": {
    "id": "17",
    "title": "St Clement's squares",
    "difficulty": "Easy",
    "portion": "Makes 15-18",
    "time": "Hands-on time 20 min, oven time 50 min, plus chilling and cooling",
    "description": "Make your mum these lemony, flower-topped St Clement's shortbreads to serve as afternoon tea on Mother's Day. They're simple but delectable: a soft shortbread-like base with a zingy citrus topping melding into it - a glorious bake for Mothering Sunday, Easter (or any day).",
    "ingredients": [
      "225g unsalted butter, chilled and cut into cubes",
      "2 fresh thyme sprigs, leaves picked",
      "100g caster sugar",
      "325g plain flour",
      "Icing sugar to dust",
      "Edible flowers to serve (optional; see tip)",
      "215g caster sugar",
      "40g plain flour",
      "Juice 2 lemons, plus finely grated zest ½",
      "Juice 1 orange, plus finely grated zest ½",
      "4 medium free-range eggs",
      "20cm x 30cm cake tin, greased and lined with non-stick baking paper"
    ],
    "method": [
      {
        "Step 1": "For the base, heat the oven to 180°C/160°C fan/gas 4. In a food processor, pulse together the butter, thyme and sugar with a pinch of salt until the mixture is creamy. Add the flour and pulse again until it just comes together to form a dough. If you don't have a food processor, beat the ingredients in a mixing bowl using an electric mixer until creamy, then quickly beat in the flour."
      },
      {
        "Step 2": "Press the dough into the lined cake tin, then chill for 30 minutes until very cold. Prick the base all over with a fork, then bake for 20-25 minutes until golden and dry."
      },
      {
        "Step 3": "Mix the topping ingredients (don't over-whisk), then immediately pour over the baked base. Return to the oven for another 20-25 minutes until just set, then leave to cool in the tin. Dust with icing sugar and scatter with edible flowers, if you like. Cut into squares or rectangles to serve."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/cakes_api/17.jpg"
  },
  "id_18": {
    "id": "18",
    "title": "Caramelised white chocolate, burnt butter and tahini cake",
    "difficulty": "A challenge",
    "portion": "Serves 20",
    "time": "Hands-on time 1 hour 40 min, oven time 1 hour 20-25 min, plus chilling",
    "description": "Bake John Whaite's epic white chocolate, burnt butter and tahini celebration cake to really impress your guests or celebrate a birthday.",
    "ingredients": [
      "150g white chocolate (we used Waitrose Belgian white chocolate), chopped",
      "300g unsalted butter, diced",
      "Grated zest 1 lemon",
      "300g caster sugar",
      "300g self-raising flour",
      "6 large free-range eggs",
      "100g caster sugar",
      "100g liquid glucose (from the baking section of supermarkets)",
      "200g mixed white and black sesame seeds (or use all white)",
      "225g unsalted butter, at room temperature",
      "100g tahini",
      "1 tsp vanilla bean paste/extract",
      "½ tsp salt",
      "300g icing sugar",
      "200g dark chocolate (at least 70% cocoa solids)",
      "1 tbsp golden syrup",
      "50g unsalted butter",
      "3 x 20cm sandwich tins, greased, bases lined with non-stick baking paper; piping bag fitted with a 1cm nozzle; palette knife"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 120°C/100°C fan/gas ½. Put the white chocolate on a baking tray and put in the oven for an hour. Every 15 minutes or so, give the chocolate a stir with a spatula. It will start to turn a little darker in colour and chalky in consistency (don't worry - it will be fine). After an hour the chocolate should taste caramelised. Take out of the oven and put in a heatproof mixing bowl."
      },
      {
        "Step 2": "Turn the oven up to 180°C/160°C fan/gas 4. Put the 300g butter in a pan set over a high heat, swirling the pan as the butter melts and bubbles. When the bubbling starts to subside you'll be left with a fine, cappuccino-like foam on top and the butter will smell nutty. Take off the heat and pour into the bowl with the chocolate. Stir to mix the chocolate into the butter, then add the lemon zest. Cool briefly, then whisk in the sugar and flour, then the eggs, to give a fairly runny batter. Divide evenly among the cake tins and bake for 20-25 minutes until lightly golden (a skewer pushed into the centre should come out clean). Leave the cakes in the tins to cool for 5 minutes, then invert onto a rack to cool completely (see Make Ahead)."
      },
      {
        "Step 3": "For the brittle, have 2 large pieces of baking paper and a rolling pin to hand. Put the sugar and glucose in a pan with 50ml cold water. Heat gently and stir with a wooden spoon until the sugar has more or less dissolved. At this point, stop stirring, turn the heat to high and bring to the boil. Don't stir or the mix may crystallise - just let it bubble. Once the syrup has turned an orangey amber, take the pan off the heat and quickly stir in the sesame seeds before the caramel sets. Immediately tip the mixture into the centre of one of the sheets of baking paper and top with the second piece. Carefully (because the brittle will be hot) use a rolling pin to roll the brittle mix between the pieces of baking paper until very thin. Set aside to cool and set hard."
      },
      {
        "Step 4": "For the buttercream, use an electric hand mixer to beat the butter and tahini in a mixing bowl until combined, aerated and pale in colour. (If using a stand mixer, use the whisk attachment.) Add the vanilla, salt and icing sugar, then whisk for 1-2 minutes more."
      },
      {
        "Step 5": "Once the sponges have cooled, put one sponge, top-side down, on a cake stand and cover the upper surface with a thin layer of buttercream. Repeat with the remaining sponges, also top-side down. Cover the entire cake as neatly as possible with more buttercream, scraping it thin with a palette knife so some cake shows through and saving some buttercream to pipe on top of the cake. Chill the cake for a good 20 minutes to firm up the buttercream."
      },
      {
        "Step 6": "For the chocolate topping, put the chocolate, syrup and butter in a small heatproof bowl and stir, set over a pan of barely simmering water (don't let the water touch the bowl). When melted and combined, leave to cool for 2 minutes, then pour over the top of the chilled cake so some dribbles down over the edge. Leave at room temperature. "
      },
      {
        "Step 7": "Fill the piping bag with the rest of the buttercream and pipe 11 generous blobs around the top of the cake. Smash the brittle into shards of different shapes and sizes, then arrange 11 of them on top of the cake, leaning against the blobs of buttercream. Enjoy the remaining brittle shards with ice cream."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/cakes_api/18.jpg"
  },
  "id_19": {
    "id": "19",
    "title": "Eric Lanlard's carrot and pumpkin celebration cake",
    "difficulty": "Medium",
    "portion": "Serves 24",
    "time": "Hands-on time 40 min, Oven time 20-25 min, plus cooling",
    "description": "Master pâtissier Eric Lanlard created this showstopping carrot cake for delicious. magazine's 15th birthday. We didn't leave a single crumb uneaten…",
    "ingredients": [
      "750g plain flour",
      "250g golden caster sugar",
      "250g light muscovado sugar",
      "1 tbsp bicarbonate of soda",
      "2 tsp ground cinnamon",
      "300ml vegetable oil",
      "5 large free-range eggs",
      "Splash whole milk",
      "1 tbsp grated fresh ginger, or 1 tsp ground ginger",
      "2 tsp vanilla bean paste",
      "Finely grated zest 2 oranges",
      "350g carrots, coarsely grated",
      "250g canned pumpkin purée (see Know-how)",
      "100g each shelled walnut and pecan halves, toasted and chopped",
      "75g golden sultanas",
      "25g shelled pecan halves",
      "25g shelled walnut halves",
      "75g golden caster sugar",
      "600g mascarpone",
      "1½ tbsp ground ginger",
      "4-5 tbsp golden icing sugar",
      "150ml double cream",
      "4 x 20cm round cake tins, lightly greased and bases lined with non-stick baking paper",
      "Lightly greased baking sheet"
    ],
    "method": [
      {
        "Step 1": "Heat the oven to 180°C/160°C fan/gas 4. Sift the flour, sugars, bicarb and cinnamon into a large bowl. In a smaller bowl, whisk the oil, eggs, milk, ginger and vanilla."
      },
      {
        "Step 2": "Add the oil mixture, orange zest, grated carrot and pumpkin puréeto the dry ingredients, then stir with a wooden spoon or spatula until almost combined. Add the chopped nuts and sultanas, then stir into the batter until just combined (see food team's tips)."
      },
      {
        "Step 3": "Divide the batter evenly among the tins. Bake for 20-25 minutes until the tops are cracked and springy to the touch. Cool in the tins for 10 minutes, then invert onto a wire rack to cool completely (see Make Ahead)."
      },
      {
        "Step 4": "For the caramelised nuts, toast the nuts in a dry frying pan until golden, then tip onto the greased baking sheet to cool. Wipe out the pan, then add the sugar and heat until melted. Bring to the boil and simmer until a deep amber colour. Immediately (and carefully) pour over the toasted nuts to coat. Set aside to cool (see food team's tips)."
      },
      {
        "Step 5": "For the frosting, beat together all the ingredients, adding enough icing sugar to make a thick, smooth mix - don't overmix. Roughly chop the cooled nuts."
      },
      {
        "Step 6": "To assemble, put one cake on a cake stand and spread with an even layer of frosting. Top with another cake and frosting, then repeat until all 4 cakes are stacked up. Cover the top and sides with the remaining frosting, then decorate with caramelised nuts. Add candles/sparklers if you want to. Happy birthday!"
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/cakes_api/19.jpg"
  },
  "id_20": {
    "id": "20",
    "title": "Tunnock's teacake traybake",
    "difficulty": "Easy",
    "portion": "Serves 16",
    "time": "Hands-on time 25 min, Oven time 25 min",
    "description": "Our traybake take on Tunnock's teacakes sees a thick layer of pillowy meringue sandwiched between a biscuity base and a blanket of chocolate. Slice into squares and share with friends as afternoon tea.",
    "ingredients": [
      "170g medium oatmeal",
      "170g wholemeal flour",
      "½ tsp fine sea salt",
      "½ tsp baking powder",
      "25g golden caster sugar",
      "30g dark muscovado sugar",
      "150g chilled, unsalted butter, diced",
      "3 tbsp milk",
      "200g dark chocolate, melted",
      "3 medium free-range egg whites",
      "150g caster sugar",
      "2 tbsp golden syrup",
      "½ tsp fine sea salt",
      "½ tsp vanilla extract",
      "33cm x 23cm swiss roll/roulade cake tin, lined with non-stick baking paper with a 3cm overhang on 2 ends"
    ],
    "method": [
      {
        "Step 1": " Heat the oven to 180°C/160°C fan/gas 4. To make the base, pulse the oatmeal, flour, salt, baking powder and sugars in a food processor, add the butter and pulse to breadcrumbs. Add the milk and whizz until the mixture comes together. Alternatively, mix the dry ingredients in a bowl, then rub in the butter and use a knife to stir in the milk."
      },
      {
        "Step 2": "Tip into the tin, then use the back of a metal spoon to press it down and smooth the top. Bake for 25 minutes or until the biscuit has come away from the edges of the tin and feels firm to the touch. Cool in the tin set on a wire rack."
      },
      {
        "Step 3": "Put all the meringue ingredients in a large heatproof bowl set over a panof simmering water (don't let the bowl touch the water). Using an electric hand mixer, whisk the mixture for 6-8 minutes until thickened - the mixture must be very stiff to hold its shape. Spoon over the cooled biscuit base."
      },
      {
        "Step 4": "Leave the meringue to set, then pour over the melted chocolate, smoothingit over with the back of a spoon. Leave in a cool place to set, then use a hot sharp knife to cut into 16 rectangles."
      }
    ],
    "image": "https://apipics.s3.amazonaws.com/cakes_api/20.jpg"
  }
}
